CSI API ETABS v1
cDetailing.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo Method
 Represents one Bar in extent - TOP BARS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	int TopRebarIndex,
	ref double X1,
	ref double Y1,
	ref double X2,
	ref double Y2,
	ref double WidthRight,
	ref double WidthLeft,
	ref double Z,
	ref double ReqAst,
	ref double ProvAst
)
Function GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo (
	DetailingOutputIndex As Integer,
	StripIndex As Integer,
	DetailingRegionIndex As Integer,
	TopRebarIndex As Integer,
	ByRef X1 As Double,
	ByRef Y1 As Double,
	ByRef X2 As Double,
	ByRef Y2 As Double,
	ByRef WidthRight As Double,
	ByRef WidthLeft As Double,
	ByRef Z As Double,
	ByRef ReqAst As Double,
	ByRef ProvAst As Double
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim StripIndex As Integer
Dim DetailingRegionIndex As Integer
Dim TopRebarIndex As Integer
Dim X1 As Double
Dim Y1 As Double
Dim X2 As Double
Dim Y2 As Double
Dim WidthRight As Double
Dim WidthLeft As Double
Dim Z As Double
Dim ReqAst As Double
Dim ProvAst As Double
Dim returnValue As Integer
returnValue = instance.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo(DetailingOutputIndex,
	StripIndex, DetailingRegionIndex,
	TopRebarIndex, X1, Y1, X2, Y2, WidthRight,
	WidthLeft, Z, ReqAst, ProvAst)
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	int TopRebarIndex,
	double% X1,
	double% Y1,
	double% X2,
	double% Y2,
	double% WidthRight,
	double% WidthLeft,
	double% Z,
	double% ReqAst,
	double% ProvAst
)
abstract GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneTopRebarInfo :
        DetailingOutputIndex : int *
        StripIndex : int *
        DetailingRegionIndex : int *
        TopRebarIndex : int *
        X1 : float byref *
        Y1 : float byref *
        X2 : float byref *
        Y2 : float byref *
        WidthRight : float byref *
        WidthLeft : float byref *
        Z : float byref *
        ReqAst : float byref *
        ProvAst : float byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
StripIndex
Type: System.Int32
 Strip Index
DetailingRegionIndex
Type: System.Int32
 Detailing region index
TopRebarIndex
Type: System.Int32
 Top rebar index
X1
Type: System.Double
 Start point X of Extent CLine, Local wrt to Region
Y1
Type: System.Double
 Start point y of Extent CLine, Local wrt to Region
X2
Type: System.Double
 End point X of Extent CLine, Local wrt to Region
Y2
Type: System.Double
 End point Y of Extent CLine, Local wrt to Region
WidthRight
Type: System.Double
 Bar distribution Width, on right side of the extent centerline
WidthLeft
Type: System.Double
 Bar distribution Width, on left side of the extent centerline
Z
Type: System.Double
 Z value in Global Coordinates, of centerline of all rebar in the extent
ReqAst
Type: System.Double
 Required area of reinforcement, as determined from ETABS
ProvAst
Type: System.Double
 Provided area of reinforcement, as detailed
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace